analysis/perf-optimize3/runs/m0132s11_simple_317fb002/pg_N.pgbench.txt
pgbench (18.3)
starting vacuum...end.
progress: 30.0 s, 11016.9 tps, lat 4.536 ms stddev 1.544, 0 failed
progress: 60.0 s, 11363.3 tps, lat 4.400 ms stddev 1.790, 0 failed
progress: 90.0 s, 11897.2 tps, lat 4.202 ms stddev 1.202, 0 failed
progress: 120.0 s, 11986.1 tps, lat 4.171 ms stddev 1.142, 0 failed
transaction type: <builtin: simple update>
scaling factor: 100
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 120 s
number of transactions actually processed: 1387939
number of failed transactions: 0 (0.000%)
latency average = 4.322 ms
latency stddev = 1.445 ms
initial connection time = 16.408 ms
tps = 11565.637783 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0 \set aid random(1, 100000 * :scale)
         0.000           0 \set bid random(1, 1 * :scale)
         0.000           0 \set tid random(1, 10 * :scale)
         0.000           0 \set delta random(-5000, 5000)
         0.226           0 BEGIN;
         0.292           0 UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.240           0 SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.184           0 INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         3.384           0 END;